function FreeItemInslay( charaindex, inslayindex, itemindex )
	if item.getInt(itemindex, "精灵" ) == -1 then
		return 1
	end
	for i = 1, table.getn(magictype) do
		
		if item.getInt(inslayindex, "类型" ) == magictype[i][1] then
			for j = 1, table.getn(magictype[i][2]) do                         
				if item.getInt(itemindex, "精灵" ) == magictype[i][2][j] then                         
					return 1
				end
			end
		end
	end
	char.TalkToCli(charaindex, -1, "无法精工在此装备上！", "黄色")
	return 0
end

function data()
	magictype = {{1, {159, 413, 189, 416, 169, 414, 139, 412, 301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 324, 325}}
							,{2, {159, 413, 189, 416, 169, 414, 139, 412, 301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 324, 325}}
							,{3, {159, 413, 189, 416, 169, 414, 139, 412, 301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 324, 325}}
							,{6, {61, 301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 324, 325}}
							,{7, {4, 5, 24, 25, 14, 15, 301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 324, 325}}
							}
end

function main()
	data()
end
